Repository: lube8163-lab/mim-ios-app
Catalog: SemanticCompression-v2/Localizable.xcstrings
Source language: en
Languages: es, ja, ko, pt_br, zh_hans, zh_hant

# settings.backend.image_understanding.siglip2
source: SigLIP2 is a lighter, stable tag extractor and is also used for Pro Mode semantic fidelity scoring.
es: SigLIP2 es un extractor de tags más ligero y estable, y también se usa para evaluar la fidelidad semántica en Modo Pro.
ja: SigLIP2 は軽量で安定したタグ抽出に向いており、プロモードの意味保持率評価にも使われます。
ko: SigLIP2는 가볍고 안정적인 태그 추출기이며, 프로 모드 의미 보존율 계산에도 사용됩니다.
pt_br: SigLIP2 é um extrator de tags mais leve e estável, e também é usado para medir a fidelidade semântica no Modo Pro.
zh_hans: SigLIP2 更轻量，适合稳定提取标签，也用于专业模式的语义保持率评分。
zh_hant: SigLIP2 更轻量，适合稳定提取标簽，也用于专业模式的語義保持率评分。

# settings.backend.image_understanding.vision
source: Apple Vision performs lightweight tag classification and builds a simple prompt without extra downloads.
es: Apple Vision realiza una clasificación ligera de tags y construye un prompt simple sin descargas extra.
ja: Apple Vision で軽量なタグ分類を行い、簡易 prompt を作ります。追加ダウンロード不要で使えます。
ko: Apple Vision은 추가 다운로드 없이 가벼운 태그 분류와 간단한 프롬프트 생성을 수행합니다.
pt_br: O Apple Vision faz uma classificação leve de tags e monta um prompt simples sem downloads extras.
zh_hans: Apple Vision 会进行轻量标签分类，并生成简易 prompt，无需额外下载。
zh_hant: Apple Vision 會进行轻量标簽分類，並生成简易 prompt，無需额外下載。

# settings.general.language
source: Language
es: Idioma
ja: 言語設定
ko: 언어
pt_br: Idioma
zh_hans: 语言
zh_hant: 語言

# settings.general.post_mode
source: Post Mode
es: Modo de publicación
ja: 投稿モード
ko: 게시 모드
pt_br: Modo de postagem
zh_hans: 发布模式
zh_hant: 發布模式

# settings.image_generation.regenerate_visible
source: Regenerate Visible Images
es: Regenerar imágenes visibles
ja: 表示中の画像を再生成
ko: 보이는 이미지 다시 생성
pt_br: Regenerar imagens visíveis
zh_hans: 重新生成当前图片
zh_hant: 重新生成当前圖片

# settings.image_generation.regenerate_visible.note
source: Clear cached images for currently visible posts and regenerate them with the selected image-generation model.
es: Borra la caché de imágenes de las publicaciones visibles y vuelve a generarlas con el modelo seleccionado.
ja: 現在表示している投稿画像のキャッシュを削除し、選択中の画像生成モデルで再生成します。
ko: 현재 보이는 게시물의 캐시 이미지를 지우고 선택한 이미지 생성 모델로 다시 생성합니다.
pt_br: Limpa as imagens em cache das postagens visíveis e as regenera com o modelo de geração selecionado.
zh_hans: 清除当前可见帖子图片的缓存，并使用当前选中的图像生成模型重新生成。
zh_hant: 清除当前可见帖子圖片的缓存，並使用当前选中的圖像生成模型重新生成。

# settings.image_playground.style.animation
source: Animation tends to produce softer, more playful-looking results.
es: Animation tiende a producir resultados más suaves y juguetones.
ja: Animation はややポップで柔らかい見た目になりやすいスタイルです。
ko: Animation은 더 부드럽고 장난스러운 느낌의 결과를 만드는 경향이 있습니다.
pt_br: Animation tende a produzir resultados mais suaves e brincalhões.
zh_hans: Animation 往往会生成更柔和、更活泼的视觉效果。
zh_hant: Animation 往往會生成更柔和、更活泼的视觉效果。

# settings.image_playground.style.illustration
source: Illustration is the most balanced and default-looking style.
es: Illustration es el estilo más equilibrado y similar al predeterminado.
ja: Illustration は最も標準的で、バランスの良い見た目になりやすいスタイルです。
ko: Illustration은 가장 균형 잡힌 기본 스타일입니다.
pt_br: Illustration é o estilo mais equilibrado e com aparência padrão.
zh_hans: Illustration 是最均衡、最标准的一种风格。
zh_hant: Illustration 是最均衡、最标准的一种风格。

# settings.image_playground.style.picker
source: Image Playground Style
es: Estilo de Image Playground
ja: Image Playground スタイル
ko: Image Playground 스타일
pt_br: Estilo do Image Playground
zh_hans: Image Playground 风格
zh_hant: Image Playground 风格

# settings.image_playground.style.sketch
source: Sketch preserves more linework and gives results a rougher drawing-like feel.
es: Sketch preserva más líneas y da un resultado más parecido a un dibujo áspero.
ja: Sketch は線の印象が残りやすく、ラフなドローイング寄りの見た目になります。
ko: Sketch는 선을 더 잘 살리고 거친 드로잉 느낌을 줍니다.
pt_br: Sketch preserva mais traços e dá aos resultados um aspecto mais rascunhado.
zh_hans: Sketch 会保留更多线条感，整体更接近草图或手绘。
zh_hant: Sketch 會保留更多线條感，整體更接近草圖或手绘。

# settings.image_playground.style.subtitle
source: This setting only applies when images are generated with Image Playground.
es: Esta opción solo se aplica cuando las imágenes se generan con Image Playground.
ja: この設定は Image Playground で画像生成するときだけ反映されます。
ko: 이 설정은 Image Playground로 이미지를 생성할 때만 적용됩니다.
pt_br: Esta opção só se aplica quando as imagens são geradas com o Image Playground.
zh_hans: 此设置仅在使用 Image Playground 生成图像时生效。
zh_hant: 此設定僅在使用 Image Playground 生成圖像時生效。

# settings.image_playground.style.title
source: Style
es: Estilo
ja: スタイル設定
ko: 스타일
pt_br: Estilo
zh_hans: 风格设置
zh_hant: 风格設定

# settings.installed.none
source: None installed
es: No hay modelos instalados
ja: 未導入
ko: 설치된 모델 없음
pt_br: Nenhum modelo instalado
zh_hans: 未安装
zh_hant: 未安裝

# settings.installed.summary
source: Image understanding: %@ Image generation: %@
es: Comprensión de imagen: %@ Generación de imagen: %@
ja: 画像理解: %@ 画像生成: %@
ko: 이미지 이해: %@ 이미지 생성: %@
pt_br: Entendimento de imagem: %@ Geração de imagem: %@
zh_hans: 图像理解：%@ 图像生成：%@
zh_hant: 圖像理解：%@ 圖像生成：%@

# settings.language.display_language
source: Display Language
es: Idioma de visualización
ja: 表示言語
ko: 표시 언어
pt_br: Idioma de exibição
zh_hans: 显示语言
zh_hant: 顯示語言

# settings.language.title
source: Language
es: Idioma
ja: 言語設定
ko: 언어
pt_br: Idioma
zh_hans: 语言设置
zh_hant: 語言設定

# settings.legal.privacy_terms
source: Privacy Policy / Terms
es: Política de privacidad / Términos
ja: プライバシーポリシー / 利用規約
ko: 개인정보 처리방침 / 이용 약관
pt_br: Política de privacidade / Termos
zh_hans: 隐私政策 / 使用条款
zh_hant: 隱私政策 / 使用條款

# settings.licenses.models_and_licenses
source: Models and Licenses
es: Modelos y licencias
ja: 使用モデルとライセンス
ko: 모델 및 라이선스
pt_br: Modelos e licenças
zh_hans: 模型与许可证
zh_hant: 模型與許可證

# settings.pro_mode.cache_in_use
source: In use: %@
es: En uso: %@
ja: 使用中: %@
ko: 사용 중: %@
pt_br: Em uso: %@
zh_hans: 已使用：%@
zh_hant: 已使用：%@

# settings.pro_mode.cache_limit
source: Pro Mode cache limit: %d MB
es: Límite de caché del Modo Pro: %d MB
ja: プロモードのキャッシュ上限: %d MB
ko: 프로 모드 캐시 한도: %d MB
pt_br: Limite de cache do Modo Pro: %d MB
zh_hans: 专业模式缓存上限：%d MB
zh_hant: 专业模式缓存上限：%d MB

# settings.pro_mode.clear_cache
source: Clear Image Cache
es: Borrar caché de imágenes
ja: 画像キャッシュを削除
ko: 이미지 캐시 지우기
pt_br: Limpar cache de imagens
zh_hans: 清除图片缓存
zh_hant: 清除圖片缓存

# settings.pro_mode.clear_cache.note
source: This clears regenerated image cache. It also removes retained originals, semantic scores, and LPIPS distances created by Pro Mode.
es: Esto borra la caché de imágenes regeneradas. También elimina originales retenidos, puntuaciones semánticas y distancias LPIPS creadas por el Modo Pro.
ja: この操作で再生成キャッシュを削除します。プロモードで保持した元画像キャッシュ、意味スコア、LPIPS知覚距離も削除されます。
ko: 재생성 이미지 캐시를 지웁니다. 프로 모드가 보관한 원본, 의미 점수, LPIPS 거리도 함께 삭제됩니다.
pt_br: Isto limpa o cache de imagens regeneradas. Também remove originais retidos, pontuações semânticas e distâncias LPIPS criadas pelo Modo Pro.
zh_hans: 此操作会清除重建图片缓存，也会删除专业模式保留的原图缓存、语义评分和LPIPS感知距离。
zh_hant: 此操作會清除重建圖片缓存，也會刪除专业模式保留的原圖缓存、語義评分和LPIPS感知距离。

# settings.pro_mode.memory_note
source: Memory usage is not a peak reading. It is the footprint measured when each step finishes.
es: El uso de memoria no es un valor pico. Es la huella medida cuando termina cada paso.
ja: メモリ使用量はピーク値ではなく、各処理が終わった時点のフットプリントです。
ko: 메모리 사용량은 피크값이 아니라 각 단계 완료 시점의 풋프린트입니다.
pt_br: O uso de memória não é um pico. É o footprint medido quando cada etapa termina.
zh_hans: 内存使用量不是峰值，而是每个处理步骤完成时的占用。
zh_hant: 內存使用量不是峰值，而是每个处理步骤完成時的占用。

# settings.pro_mode.siglip_missing
source: LPIPS perceptual distance is still available, but SigLIP2 is required for semantic fidelity scoring. You can enable Pro Mode without it, though semantic scores will stay unavailable.
es: La distancia perceptual LPIPS sigue disponible, pero SigLIP2 es necesario para la fidelidad semántica. Puedes activar el Modo Pro sin él, aunque las puntuaciones semánticas no estarán disponibles.
ja: LPIPSによる知覚距離評価は利用できますが、意味保持率の計算には SigLIP2 モデルが必要です。未導入でもプロモードは有効化できますが、意味スコアは表示されません。
ko: LPIPS 지각 거리는 사용할 수 있지만, 의미 보존율 계산에는 SigLIP2가 필요합니다. SigLIP2 없이도 프로 모드는 켤 수 있지만 의미 점수는 표시되지 않습니다.
pt_br: A distância perceptual LPIPS continua disponível, mas o SigLIP2 é necessário para calcular a fidelidade semântica. Você pode ativar o Modo Pro sem ele, mas as pontuações semânticas ficarão indisponíveis.
zh_hans: 即使没有 SigLIP2，仍可使用 LPIPS 感知距离评估；但语义保持率计算仍需要 SigLIP2 模型。未安装时也可以开启专业模式，但不会显示语义评分。
zh_hant: 即使没有 SigLIP2，仍可使用 LPIPS 感知距离评估；但語義保持率计算仍需要 SigLIP2 模型。未安裝時也可以開啟专业模式，但不會顯示語義评分。

# settings.pro_mode.subtitle
source: Keep original-image cache for your posts and show semantic fidelity, LPIPS perceptual distance, processing time, and memory usage for regenerated results. Memory is shown as the footprint at completion.
es: Mantiene la caché de imágenes originales de tus publicaciones y muestra fidelidad semántica, distancia perceptual LPIPS, tiempo de proceso y uso de memoria. La memoria se muestra como huella al finalizar.
ja: 自分の投稿画像の元画像キャッシュを保持し、再生成結果との意味保持率、LPIPS知覚距離、処理時間、メモリ使用量を表示します。メモリ値は処理完了時点のフットプリントです。
ko: 내 게시물의 원본 이미지 캐시를 유지하고, 의미 보존율, LPIPS 지각 거리, 처리 시간, 메모리 사용량을 표시합니다. 메모리는 완료 시점의 풋프린트입니다.
pt_br: Mantém o cache de imagens originais das suas postagens e mostra fidelidade semântica, distância perceptual LPIPS, tempo de processamento e uso de memória. A memória é mostrada como footprint ao finalizar.
zh_hans: 为你自己的帖子保留原图缓存，并显示与重建结果的语义保持率、LPIPS感知距离、处理时间和内存使用量。内存值显示的是每一步完成时的占用。
zh_hant: 為你自己的帖子保留原圖缓存，並顯示與重建结果的語義保持率、LPIPS感知距离、处理時间和內存使用量。內存值顯示的是每一步完成時的占用。

# settings.pro_mode.title
source: Pro Mode
es: Modo Pro
ja: プロモード
ko: 프로 모드
pt_br: Modo Pro
zh_hans: 专业模式
zh_hant: 专业模式

# settings.sd.options.note
source: Even for L2-L4 posts, Stable Diffusion will run without an init image and rely only on the semantic prompt. This reduces structural guidance, but can avoid blur or distortions introduced by the init image.
es: Incluso para publicaciones L2-L4, Stable Diffusion puede ejecutarse sin imagen inicial y apoyarse solo en el prompt semántico. Esto reduce la guía estructural, pero puede evitar desenfoque o distorsiones introducidas por la imagen inicial.
ja: L2〜L4 の投稿でも初期画像を使わず、semantic prompt のみで Stable Diffusion を実行します。構図の手がかりは減りますが、初期画像由来のノイズや崩れを避けたいときに有効です。
ko: L2-L4 게시물에서도 Stable Diffusion이 초기 이미지 없이 의미 프롬프트만으로 동작합니다. 구조적 가이드는 줄지만 초기 이미지에서 생기는 블러나 왜곡을 피할 수 있습니다.
pt_br: Mesmo para postagens L2-L4, o Stable Diffusion pode rodar sem imagem inicial e depender apenas do prompt semântico. Isso reduz a orientação estrutural, mas pode evitar borrões ou distorções introduzidas pela imagem inicial.
zh_hans: 即使是 L2-L4 帖子，Stable Diffusion 也不会使用初始图像，而只依赖 semantic prompt。这样会减少构图引导，但有助于避免初始图像带来的噪声与变形。
zh_hant: 即使是 L2-L4 帖子，Stable Diffusion 也不會使用初始圖像，而只依赖 semantic prompt。這样會减少构圖引導，但有助于避免初始圖像带來的噪声與变形。

# settings.sd.options.prefer_text2img
source: Prefer text2img over init image
es: Preferir text2img sobre imagen inicial
ja: 初期画像を使わず text2img を優先
ko: 초기 이미지보다 text2img 우선
pt_br: Preferir text2img em vez de imagem inicial
zh_hans: 优先使用 text2img 而不是初始图像
zh_hant: 优先使用 text2img 而不是初始圖像

# settings.sd.options.subtitle
source: Adjust how the standard SD15 pipeline behaves when needed.
es: Ajusta el comportamiento del pipeline SD15 estándar cuando sea necesario.
ja: 通常版 SD15 の挙動を必要に応じて調整できます。
ko: 필요할 때 기본 SD15 파이프라인 동작을 조정합니다.
pt_br: Ajuste o comportamento do pipeline SD15 padrão quando necessário.
zh_hans: 可按需调整标准版 SD15 的生成行为。
zh_hant: 可按需调整标准版 SD15 的生成行為。

# settings.sd.options.title
source: Generation Options
es: Opciones de generación
ja: 生成オプション
ko: 생성 옵션
pt_br: Opções de geração
zh_hans: 生成选项
zh_hant: 生成选项

# settings.section.about
source: About
es: Acerca de
ja: このアプリについて
ko: 정보
pt_br: Sobre
zh_hans: 关于本应用
zh_hant: 关于本应用

# settings.section.ai_backends
source: AI Backends
es: Backends de IA
ja: AI バックエンド
ko: AI 백엔드
pt_br: Backends de IA
zh_hans: AI 后端
zh_hant: AI 後端

# settings.section.image_generation
source: Image Generation
es: Generación de imágenes
ja: 画像生成
ko: 이미지 생성
pt_br: Geração de imagem
zh_hans: 图像生成
zh_hant: 圖像生成

# settings.section.licenses
source: Licenses
es: Licencias
ja: ライセンス
ko: 라이선스
pt_br: Licenças
zh_hans: 许可证
zh_hant: 許可證

# settings.section.pro_features
source: Pro Features
es: Funciones Pro
ja: プロ機能
ko: 프로 기능
pt_br: Recursos Pro
zh_hans: 专业功能
zh_hant: 专业功能

# settings.title
source: Settings
es: Configuración
ja: 設定
ko: 설정
pt_br: Configurações
zh_hans: 设置
zh_hant: 設定

# legal.title
source: Legal
ja: 法務
ko: 법적 고지
zh_hans: 法律
zh_hant: 法律

# post_card.report_reason.spam
source: Spam
ja: スパム
ko: 스팸
zh_hans: 垃圾信息
zh_hant: 垃圾訊息

# profile.app
source: App
ja: アプリ
ko: 앱
zh_hans: 应用
zh_hant: 應用

# settings.section.general
source: General
ja: 一般
ko: 일반
pt_br: Geral
zh_hans: 通用
zh_hant: 通用

# settings.section.legal
source: Legal
ja: 法務
ko: 법적 고지
zh_hans: 法律
zh_hant: 法律
